In [11]:
import pandas as pd

In [12]:
dados = {
    "Nome": ['alice','bob','charlie'],
    "Idade":[24,30,22],
    "Cidade":['São Paulo','Rio de Janeiro','Belo Horizonte']
}
dados

{'Nome': ['alice', 'bob', 'charlie'],
 'Idade': [24, 30, 22],
 'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte']}

In [13]:
df = pd.DataFrame(dados)
df

      Nome  Idade          Cidade
0    alice     24       São Paulo
1      bob     30  Rio de Janeiro
2  charlie     22  Belo Horizonte

In [14]:
df.head(1)

    Nome  Idade     Cidade
0  alice     24  São Paulo

In [15]:
df.tail(1)

      Nome  Idade          Cidade
2  charlie     22  Belo Horizonte

In [16]:
dados_notas = {
    'nome':['alice','bob','charlie','david','eva'],
    'matematica':[58,90,78,88,92],
    'fisica':[80,75,88,85,95],
    'quimica':[78,82,85,80,88]
}

In [19]:
df_notas = pd.DataFrame(dados_notas)
df_notas

      nome  matematica  fisica  quimica
0    alice          58      80       78
1      bob          90      75       82
2  charlie          78      88       85
3    david          88      85       80
4      eva          92      95       88

In [21]:
#calcular a méddia das notas por aluno 
df_notas['Média'] = df_notas[["matematica","fisica","fisica"]].mean(axis=1)
df_notas

      nome  matematica  fisica  quimica      Média
0    alice          58      80       78  72.666667
1      bob          90      75       82  80.000000
2  charlie          78      88       85  84.666667
3    david          88      85       80  86.000000
4      eva          92      95       88  94.000000

In [22]:
#identificar alunos aprovados com nota excelente ( acuma de 83)
alunos_aprovados = df_notas[df_notas["Média"] >= 83]
alunos_aprovados

      nome  matematica  fisica  quimica      Média
2  charlie          78      88       85  84.666667
3    david          88      85       80  86.000000
4      eva          92      95       88  94.000000

In [24]:
#Exibir a média e os alunos aprovados 
df_notas[["nome",'Média']]

      nome      Média
0    alice  72.666667
1      bob  80.000000
2  charlie  84.666667
3    david  86.000000
4      eva  94.000000

In [25]:
alunos_aprovados[['nome', 'Média']]

      nome      Média
2  charlie  84.666667
3    david  86.000000
4      eva  94.000000